---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.StructuralConnectionApprovalType
source: html/7aeb5523-482b-710c-bfb8-2d410575bc57.htm
---
# StructuralConnectionApprovalType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.